# Step. Import the necessary libraries

In [2]:
import pandas as pd

# Step. Import the dataset from this address.
# Step. Assign it to a variable called baby_names.

In [6]:
baby_names = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv')
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

# Step. See the first 10 entries

In [4]:
baby_names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

# Step. Delete the column 'Unnamed: 0' and 'Id'

In [10]:
baby_names=baby_names.loc[:,'Name':]
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

# Step. Are there more male or female names in the dataset?

In [11]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

# Step. Group the dataset by name and assign to names

In [19]:
baby_names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

In [20]:
baby_names.Name.head()

0       Emma
1    Madison
2     Hannah
3      Grace
4      Emily
Name: Name, dtype: object

In [42]:
names =  baby_names['Count'].groupby(baby_names['Name']).sum().to_frame()
names = names.sort_values(by='Count', ascending=False)
names.head()

           Count
Name
Jacob     242874
Emma      214852
Michael   214405
Ethan     209277
Isabella  204798

# Step. How many different names exist in the dataset?

In [43]:
len(names)

17632

# Step. What is the name with most occurrences?

In [46]:
names.Count.idxmax()

'Jacob'

# Step. How many different names have the least occurrences?

In [57]:
names[names.Count == min(names.Count)]

            Count
Name
Ithzel          5
Varick          5
Lavi            5
Toma            5
Tobechukwu      5
...           ...
Eniola          5
Atlantis        5
Marci           5
Simarpreet      5
Nita            5

[2578 rows x 1 columns]

# Step. What is the median name occurrence?

In [59]:
names[names.Count == names.Count.median()]

          Count
Name
Zuleima      49
Vita         49
Aziah        49
Kaedence     49
Antonina     49
...         ...
Mckynzie     49
Yoni         49
Hareem       49
Jkwon        49
Nazier       49

[66 rows x 1 columns]

# Step. What is the standard deviation of names?

In [60]:
names.Count.std()

11006.0694678915

# Step. Get a summary with the mean, min, max, std and quartiles.

In [63]:
names.describe().T

         count         mean           std  min   25%   50%    75%       max
Count  17632.0  2008.932169  11006.069468  5.0  11.0  49.0  337.0  242874.0